import { product1 } from "../constants/dr_links";
import {
  achieve,
  business,
  business2,
  solution,
  targetPoint,
} from "../constants/why_us_image_links";
import type { Translation } from "./../interfaces/base_translation";
// Arabic data
export const ar: Translation = {
  locale: "ar",
  dir: "rtl",
  // Add Arabic translations here based on the "en" structure
  page_title: "شركة نجم عبدي",
  home_literal: "الرئيسية",
  activities_literal: "المنتجات",
  contact_literal: "اتصل بنا",
  contact_us_literal: "اتصل بنا",
  see_video_literal: "شاهد الفيديو",
  donate_literal: "اعرف اكثر",
  main_header: "منتجـــات ممــيزة",
  main_header_part2: "بأفضل جودة!",
  sub_header:
    "عنوان التميــــز, نحن خيـــارك الاول دائـــما و في كـل الاوقـــات",
  contact_us_sub_title:
    "اختر الأسلوب الذي يناسبك أفضل للاتصال بنا! سنعاود الاتصال بك في أقرب وقت ممكن",
  whatsapp_lit: "واتساب",
  gmail_lit: "البريد الإلكتروني",
  instagram_lit: "إنستغرام",
  facebook_lit: "فيسبوك",
  loading_lit: "جاري التحميل...",
  or_you_can_lit: "أو يمكنك",
  first_name_lit: "الاسم الأول",
  last_name_lit: "اسم العائلة",
  organization_lit: "المؤسسة",
  contact_reason_lit: "سبب الاتصال",
  message_title_lit: "عنوان الرسالة",
  message_lit: "الرسالة",
  website_or_email_lit: "الموقع الإلكتروني أو البريد الإلكتروني",
  submit_lit: "إرسال",
  make_bright_future_slogan: "صنع مستقبل مشرق",
  encourgement_statement: "طريقك للتميز يبدأ الان!",
  learn_about_causes_literal: "تعرف على مزيد عن قضيتنا",
  close_literal: "إغلاق",
  send_to_literal_with_col: "إرسال إلى:",
  donate_through_rafidain_title: "التبرع من خلال الرافدين",
  master_card_id_literal: "إرسال إلى بطاقة ماستر:",
  donate_through_zaincash_title: "التبرع من خلال زين كاش",
  learn_more_title: "تعرف المزيد عنا",
  learn_more_description:
    "مجمع ميديا الطبي يعتبر من أبرز المراكز الطبية الشاملة التي تجمع بين الخبرات الطبية المتنوعة والتكنولوجيا الحديثة لتقديم رعاية ممتازة وشاملة للمرضى. يتميز المجمع بفريقه الطبي المتخصص والمؤهل الذي يعمل بتفانٍ على تحسين جودة الحياة وصحة المجتمع. يضم مجمع ميديا الطبي فريقًا من الأطباء والمتخصصين المحترفين الذين يتمتعون بالخبرة والكفاءة في مجالاتهم. يعمل الفريق بروح الفريق الواحد لضمان تقديم الرعاية الصحية الأمثل لكل مريض، حيث يولون العناية الشخصية والتفاني في تلبية احتياجات المرضى أولوية قصوى ",
  footer_slogan_p1: "من أجل حياة",
  footer_slogan_p2: "صحية",
  map_location_lit: "الموقع على الخريطة",
  mail_lit: "البريد",
  prodcuts: [
    {
      specialty:
        "افضل انواع الحلويات من شركتنا اليت تسعد الجميع و مستورة من افضل الجودة العالمية, نوزعها في كافة انحاء العراق",
      name: "الحـــلويات",
      bgClass: product1,
    },
  ],
  our_products: "منتــــجاتنا",
  medical_services: "لما تختار شركتنا؟",
  dental_cleaning: "تنظيف و تبييض",
  dental_cleaing_sub:
    "تأتي عيادتنا بفخر بتقديم أفضل خدمات تنظيف الأسنان في هذه المدينة الجميلة. لا تُعد خدماتنا مجرد تنظيف عادي، بل هي تجربة متكاملة تجمع بين الجودة العالية والرعاية الشخصية. نحن هنا لنلبي كافة احتياجاتك، فمع قاعدة بياناتنا الواسعة والموثوقة، ستجد كل ما تحتاج إليه بسهولة.",
  comapny_brief_title: "عن الــشــركة",
  name_dummy: "محـمد علي",
  review_dummy:
    "كان لدي وقت ممتع حقًا أثناء وضع التقويم في هذه العيادة، كان الجميع لطيفًا، وقاموا بإزالته بوضوح وبشكل جيد، والسيدة التي كانت هناك رعتني طوال الوقت. شكرًا لـ مجمع ميديا الطبي المتخصص!",
  company_brief:
    "أن شركة نجم عبدي تعتبر من الشركات الرائدة في العراق و اقليم كردستــان في مجال التجارة العامة و قد تطورت الشركة منذ تأسيسها في مدينة زاخو في عام 1991 حتى وصلت الى كافة محافظات العراق و اقليم كوردستان و تؤمن الشركة بالجودة و التميز في الخدمة حيق ان منتجاتها تشمل كل ما يهم المستهلك من منتوجات غذائية و حلويات.",
  why_us_data: [
    {
      title: "افضل الخدمات",
      content:
        "شركتنا تتفرد بتقديم أفضل الخدمات في موقعنا الخاص، حيث نجمع بين التميز والابتكار لتلبية احتياجات عملائنا. نحرص على تقديم خدمات عالية الجودة في مجال التجارة العامة",
      imageLink: business,
    },
    {
      title: "تجربة تسوق استثنائية",
      content:
        "قدم تجربة تسوق فريدة واستثنائية لعملائنا، مع مجموعة واسعة من المنتجات على موقعنا السهل الاستخدام.",
      imageLink: targetPoint,
    },
    {
      title: "منتجات ذات جودة عالية",
      content:
        "شمل خدماتنا مجموعة منتقاة بعناية من منتجات غذائية وحلويات ذات جودة عالية تلبي توقعاتكم.",
      imageLink: solution,
    },
    {
      title: "توصيل سريع وفعال",
      content:
        "نحرص على تقديم خدمة توصيل سريعة وفعالة لضمان وصول منتجاتنا إليك في أقصر وقت ممكن.",
      imageLink: achieve,
    },
    {
      title: "ابتكار في العروض",
      content:
        "نتفرد بتقديم عروض مبتكرة وتنوع في منتجاتنا، لتلبية مختلف احتياجات عملائنا بشكل مستمر. نحن الخيار الافضل في هذا",
      imageLink: business2,
    },
  ],
};
